package cmd

import (
	"bassit/app"
	"os"

	"github.com/spf13/cobra"
)

var rootCmd = &cobra.Command{
	Use:   "bassit",
	Short: "",
	Long: `        
              ╭◜‾‾◝╮        ╭◜‾‾◝╮        ╭◜‾‾◝╮        ╭◜‾‾◝╮           
            ◞◜      ◝◟    ◞◜      ◝◟    ◞◜      ◝◟    ◞◜      ◝◟         
           (          )  (          )  (          )  (          )        
           \          /  \          /  \          /  \          /        
            ◝‒◟    ◞‒◜    ◝‒◟    ◞‒◜    ◝‒◟    ◞‒◜    ◝‒◟    ◞‒◜         
               ⎫╭╮⎧          ⎫╭╮⎧          ⎫╭╮⎧          ⎫╭╮⎧            
               ╰┤├╯          ╰┤├╯          ╰┤├╯          ╰┤├╯            
         ◜‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾-ˍ     
        /                                                           ‾ˍ   
       /                                                              \  
      /    ◜‾‾◝          ◜‾‾◝          ◜‾‾◝          ◜‾‾◝              \ 
     /     ▏()▕          ▏()▕          ▏()▕          ▏()▕               \
    /      ◟ˍˍ◞          ◟ˍˍ◞          ◟ˍˍ◞          ◟ˍˍ◞               ▕
  ˍ◞ˍˍˍ--‾‾‾     ˍˍˍ---‾‾‾     ˍˍˍ---‾‾‾     ˍˍˍ---‾‾‾                  ▕
  \\    ˍˍˍ---‾‾‾     ˍˍˍ---‾‾‾    ˍ ˍˍ---‾‾‾                           /
   \\‾‾‾      ˍˍˍ---‾‾‾    ˍˍˍ---‾‾‾      ◟ˍ                           / 
    \\ˍˍ---‾‾‾    ˍˍˍ---‾‾‾             ˍ ‾◟◞  ˍˍ--‾‾‾-ˍ              /  
     \\  ˍˍˍ---‾‾‾                  /‾   \  ˍ-‾         ‾ˍ         ˍˍ‾   
      \\‾           ˍˍˍ         /‾  ‾‾‾) ˍ-‾              ‾------‾‾     
       \\ˍˍ---ˍˍ    \  \    ◜\  ‾‾‾) ‾ˍ-‾                             
                ⌝ˍ   \-◠-ˍ  (‾\  ‾‾ˍ-‾                                
                  ⌝ˍ  \   \ ╰-╯‾ˍ-‾                                   
                    ⌝ˍ \ˍ◞╯  ˍ-‾                                      
                      \ˍˍ--‾‾                                         
`,
	Run: func(cmd *cobra.Command, args []string) {
		app.Run()
	},
}

func Execute() {
	err := rootCmd.Execute()
	if err != nil {
		os.Exit(1)
	}
}

func init() {
}
